

import 'package:tmtt/src/resources/languages/strings.dart';


Map<String, String> translations_th = {
  Strings.confirm                   : 'ยืนยัน',
  Strings.skip                      : 'ข้าม',
  Strings.doSetting                 : 'การตั้งค่า',
  Strings.cancel                    : 'ยกเลิก',
  Strings.next                      : 'ถัดไป',

  // push
  Strings.pushNewMessageTitle       : "คุณได้รับข้อความใหม่",
  Strings.pushNewMessageContent     : "กดเพื่อเปิด 😀",

  Strings.registerDesc1             : 'มารับข้อความบนโซเชียลมีเดียอย่างอินสตาแกรมแบบไม่ระบุตัวตนกัน!',
  Strings.registerDesc2             : 'ลิงก์นี้จะช่วยให้ผู้คนเข้าถึงโปรไฟล์ TMTT ของคุณได้',
  Strings.registerDesc3             : '(โปรดป้อนไอดีอินสตาแกรมของคุณเพื่อดำเนินการต่อ)',
  Strings.registerCreateYourOwnLInk : 'สร้างลิงก์ของคุณ',

  //home
  Strings.homeContent1              : "ลองถามคำถามถึงผู้ติดตามของคุณ!",
  Strings.homeContent2              : "แค่ทำตาม 2 ขั้นตอนง่ายๆ",
  Strings.homeContent3              : "ขั้นตอนที่ 1 คัดลอกลิงก์ของคุณ",
  Strings.homeContent4              : "ขั้นตอนที่ 2 แชร์ลิงก์ของคุณบนสตอรี่ในอินสตาแกรม",
  Strings.homeContent5              : "แล้วคุณจะได้รับข้อความตอบกลับแบบไม่ระบุตัวตน",
  Strings.homeButtonRandom          : "สุ่ม",
  Strings.homeButtonTemplate        : "Template",
  Strings.homeButtonHelp            : "ความช่วยเหลือ",
  Strings.homeButtonCopyLink        : "คัดลอกลิงก์",
  Strings.homeButtonCopyLinkAction  : "คัดลอกแล้ว!",
  Strings.homeButtonShare           : "แชร์",

  // home -> help dialog
  Strings.helpTitle                 : "วิธีแชร์",
  Strings.helpSubtitle              : "Get many anonymous\ncompliments from your followers.",
  Strings.helpButtonDontShowAnymore : "อย่าแสดงให้ฉันเห็นอีก",
  Strings.helpButtonConfirm         : "Got it, Thanks!",
  Strings.helpButtonNext            : "ถัดไป",

  // Settings
  Strings.settingFeedback1            : 'ข้อเสนอแนะ',
  Strings.settingFeedback2            : 'รายงานปัญหาทางเทคนิคหรือแนะนำลูกเล่นใหม่ๆ',
  Strings.settingFeedbackEmailSubject : "TMTT Feedback",
  Strings.settingFeedbackEmailBody    : "ลองบอกเราเกี่ยวกับปัญหาหรือ",
  Strings.settingLanguage1            : 'ภาษา',
  Strings.settingLanguage2            : 'เปลี่ยนภาษาในแอพ',
  Strings.settingDeactivate1          : 'ปิดการใช้งานบัญชีของคุณ',
  Strings.settingDeactivate2          : 'ไม่สามารถยกเลิกได้',
  Strings.settingDeactivate3          : "หากคุณกดที่คำว่ายืนยัน บัญชีของคุณจะถูกปิดใช้งาน",
  Strings.settingDeactivate4          : "ปิดการใช้งานบัญชีของคุณ",
  Strings.settingPrivacypolicy1       : 'นโยบายความเป็นส่วนตัว',
  Strings.settingPrivacypolicy2       : 'อ่านนโยบายความเป็นส่วนตัวของ TMTT',

  // create your slug page
  Strings.slugCreateError1            : 'ชื่อนี้มีคนใช้แล้ว!',
  Strings.slugCreateError2            : 'ชื่อพ่วงท้ายลิงก์สามารถใช้ได้แค่ตัวอักษร ตัวเลข _ และ . เท่านั้น',
  Strings.slugPopupContent1           : 'ยืนยันบัญชีอินสตาแกรมของคุณ',
  Strings.slugPopupContent2           : 'นี่คือบัญชีของคุณใช่หรือไม่',
  Strings.slugPopupButtonYes          : 'ใช่! นี่คือบัญชีของฉัน',
  Strings.slugPopupButtonNo           : 'ไม่ใช่ นี่ใครก่อน',
  Strings.slugPopupFollowers          : 'ผู้ติดตาม',
  Strings.slugPopupFollowing          : 'กำลังติดตาม',


// Message
  Strings.messageButtonReply          : 'ตอบกลับ',
  Strings.messageButtonWhoSentThis    : 'ใครส่งมา?',
  Strings.messageEmptyState           : "ยังไม่มีข้อความ",
  Strings.messageEmptyStateBody       : "คุณได้แชร์ข้อความกับผู้ติดตามคุณหรือไม่",
  Strings.messageHint1                : 'จังหวัด',
  Strings.messageHint2                : 'ประเทศ',
  Strings.messageHint3                : 'เวลาที่ส่ง',
  Strings.messageHint4                : 'อาชีพ',
  Strings.messageHint5                : 'แพลตฟอร์ม',
  Strings.messageHint6                : 'อุปกรณ์',
  Strings.messageHint7                : 'ซอฟต์แวร์',
  Strings.messageUnlockTitle          : "ใครส่งมา?",
  Strings.messageUnlockButton         : "ดูคำใบ้",
  Strings.messageUnlockBody           : "เฉพาะสมาชิกแบบพรีเมี่ยมเท่านั้นที่จะสามารถเห็นคำใบ้ของคนที่ส่งข้อความมา",
  Strings.messageUnlockRenewWarning   : "ต่ออายุสมาชิกทุกๆสัปดาห์ 'เงื่อนไขการให้บริการ'",
};
